In [17]:
import pandas as pd 
import numpy as np

In [3]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [4]:
avg = df['Age'].mean()
avg

30.272590361445783

In [6]:
df['Age']= df['Age'].fillna(avg)

In [8]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [17]:
df['Cabin'] = pd.to_numeric(df['Cabin'], errors='coerce')  
mean_cabin = df['Cabin'].mean()
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.50000,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.00000,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.00000,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.00000,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.00000,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,30.27259,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,NaN,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.50000,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,30.27259,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,30.27259,1,1,2668,22.3583,NaN,C

In [19]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          418
Embarked         0
dtype: int64

In [20]:
avg = df['Fare'].mean()
avg

35.6271884892086

In [21]:
df['Fare']= df['Fare'].fillna(avg)

In [22]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          418
Embarked         0
dtype: int64

In [23]:
avg = df['Cabin'].mean()
avg

nan

In [28]:
df['Cabin']= df['Cabin'].fillna(avg)

In [27]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          418
Embarked         0
dtype: int64

In [33]:
df['Cabin'] = df['Cabin'].fillna('Unknown')
unique_cabins = df['Cabin'].unique()

# Check for missing values after filling 'Cabin'
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [6]:
import pandas as pd
import numpy as np
# Read the CSV file
df = pd.read_csv('tested.csv')

In [7]:
# Handle missing values in 'Age', 'Fare', and 'Cabin'
avg_age = df['Age'].mean()
df['Age'] = df['Age'].fillna(avg_age)

In [8]:
avg_fare = df['Fare'].mean()
df['Fare'] = df['Fare'].fillna(avg_fare)

In [15]:
df['Cabin'] = pd.to_numeric(df['Cabin'], errors='coerce')
mean_cabin = df['Cabin'].mean()
df['Cabin'] = df['Cabin'].fillna(mean_cabin)
df['Cabin'] = df['Cabin'].fillna('C1')

In [16]:
# Identify and handle outliers in 'Age', 'Fare', and 'Cabin'
def handle_outliers(column):
    column = column.copy()  # Create a copy to avoid the SettingWithCopyWarning
    if pd.api.types.is_numeric_dtype(column):
        Q1 = np.percentile(column, 25)
        Q3 = np.percentile(column, 75)
        IQR = Q3 - Q1
        lower_bound = Q1 - 1.5 * IQR
        upper_bound = Q3 + 1.5 * IQR
        column[(column < lower_bound) | (column > upper_bound)] = np.nan
    return column

In [13]:
df['Age'] = handle_outliers(df['Age'])
df['Fare'] = handle_outliers(df['Fare'])
df['Cabin'] = handle_outliers(df['Cabin'])

# Replace missing values after handling outliers
df['Age'] = df['Age'].fillna(avg_age)
df['Fare'] = df['Fare'].fillna(avg_fare)
df['Cabin'] = df['Cabin'].fillna(mean_cabin)

# Check for missing values after handling outliers
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [14]:
print(df)

     PassengerId  Survived  Pclass  \
0            892         0       3
1            893         1       3
2            894         0       2
3            895         0       3
4            896         1       3
..           ...       ...     ...
413         1305         0       3
414         1306         1       1
415         1307         0       3
416         1308         0       3
417         1309         0       3

                                             Name     Sex       Age  SibSp  \
0                                Kelly, Mr. James    male  34.50000      0
1                Wilkes, Mrs. James (Ellen Needs)  female  47.00000      1
2                       Myles, Mr. Thomas Francis    male  30.27259      0
3                                Wirz, Mr. Albert    male  27.00000      0
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.00000      1
..                                            ...     ...       ...    ...
413                            Spector, Mr. Woolf    male  30.27259      0
414                  Oliva y Ocana, Dona. Fermina  female  39.00000      0
415                  Saether, Mr. Simon Sivertsen    male  38.50000      0
416                           Ware, Mr. Frederick    male  30.27259      0
417                      Peter, Master. Michael J    male  30.27259      1

     Parch              Ticket       Fare    Cabin Embarked
0        0              330911   7.829200  Unknown        Q
1        0              363272   7.000000  Unknown        S
2        0              240276   9.687500  Unknown        Q
3        0              315154   8.662500  Unknown        S
4        1             3101298  12.287500  Unknown        S
..     ...                 ...        ...      ...      ...
413      0           A.5. 3236   8.050000  Unknown        S
414      0            PC 17758  35.627188  Unknown        C
415      0  SOTON/O.Q. 3101262   7.250000  Unknown        S
416      0              359309   8.050000  Unknown        S
417      1                2668  22.358300  Unknown        C

[418 rows x 12 columns]